/*
<문제>
[테트로미노](https://www.acmicpc.net/problem/14500)

<구현 방법>
4개의 블럭으로 만들 수 있는 모든 조합을 types에 저장했다. (노가다)
이를 돌면서 제일 큰 걸로 갱신해주었다.

<트러블 슈팅>

*/

n, m = map(int, input().split())
papers = [[0 for _ in range(m + 3)] for _ in range(n + 3)]
for i in range(n):
    paper = list(map(int, input().split()))
    for j in range(m):
        papers[i][j] = paper[j]

types = [[[0, 0], [0, 1], [0, 2], [0, 3]],
         [[0, 0], [1, 0], [2, 0], [3, 0]],
         [[0, 0], [0, 1], [1, 0], [1, 1]],
         [[0, 0], [1, 0], [2, 0], [2, 1]],
         [[2, 0], [2, 1], [1, 1], [0, 1]],
         [[0, 0], [0, 1], [1, 0], [2, 0]],
         [[1, 0], [1, 1], [1, 2], [0, 2]],
         [[0, 0], [0, 1], [0, 2], [1, 0]],
         [[0, 0], [0, 1], [1, 1], [2, 1]],
         [[0, 0], [0, 1], [0, 2], [1, 2]],
         [[0, 0], [1, 0], [1, 1], [1, 2]],
         [[0, 0], [1, 0], [1, 1], [2, 1]],
         [[1, 0], [2, 0], [1, 1], [0, 1]],
         [[1, 0], [1, 1], [0, 1], [0, 2]],
         [[0, 0], [0, 1], [1, 1], [1, 2]],
         [[0, 0], [0, 1], [0, 2], [1, 1]],
         [[0, 0], [1, 0], [1, 1], [2, 0]],
         [[0, 1], [1, 0], [1, 1], [1, 2]],
         [[1, 0], [0, 1], [1, 1], [2, 1]]]

result = 0
for i in range(n):
    for j in range(m):
        for type in types:
            num = 0
            for t in range(4):
                num += papers[i + type[t][0]][j + type[t][1]]
            result = max(result, num)
print(result)
